ドキュメントをMermaid記法に変更
